stats-test.org
* Statistical Tests
** P-Values
   - Can we accept or reject the null hypothesis?
     - usually choose a threshold
     - 0.05 is popular
     - 0.01 is safer
     - People get uncomfortable when you get values anywhere near
       there.
     - P-values are not really comparable. Maybe in magnitude.
     - Large datasets generally cause pretty clear p-values.
** T-Test
   - Student's T Test
     - Originally used to for ensuring the quality of beer
       - Not just any beer: Guiness
     - process comparison
     - Compare distributions
     - Student is William Sealy Gosset, Student is a pen name.
     - Why do we care?
       - Compare if two generally normally distributions 
         have equal means?
       - What if we got lucky and found the means to be the same? 
         - What is the chance of that?
       - Can we trust it?
     - When not to use it:
       - when the data is not normal.
*** T-Test in R
       - in R:
         #+BEGIN_SRC R
          t.test(rnorm(100),rnorm(100))
          t.test(runif(100),rnorm(100))
          t.test(rnorm(100,1),rnorm(100))
         #+END_SRC

         #+BEGIN_EXAMPLE
            > t.test(rnorm(100),rnorm(100))
            
            	Welch Two Sample t-test
            
            data:  rnorm(100) and rnorm(100) 
            t = 0.3034, df = 193.367, p-value = 0.7619
            alternative hypothesis: true difference in means is not equal to 0 
            95 percent confidence interval:
             -0.2330280  0.3177391 
            sample estimates:
             mean of x  mean of y 
            0.07018111 0.02782554 
            
            > t.test(runif(100),rnorm(100))
            
            	Welch Two Sample t-test
            
            data:  runif(100) and rnorm(100) 
            t = 2.7514, df = 115.295, p-value = 0.006893
            alternative hypothesis: true difference in means is not equal to 0 
            95 percent confidence interval:
             0.08531389 0.52385119 
            sample estimates:
            mean of x mean of y 
            0.4778445 0.1732620 
            
            > t.test(rnorm(100,1),rnorm(100))
            
            	Welch Two Sample t-test
            
            data:  rnorm(100, 1) and rnorm(100) 
            t = 6.1553, df = 197.077, p-value = 4.116e-09
            alternative hypothesis: true difference in means is not equal to 0 
            95 percent confidence interval:
             0.5696437 1.1067288 
            sample estimates:
            mean of x mean of y 
            0.9432221 0.1050358 
            
            > t.test(rnorm(100,1),rnorm(100))
            
            	Welch Two Sample t-test
            
            data:  rnorm(100, 1) and rnorm(100) 
            t = 5.6662, df = 195.334, p-value = 5.176e-08
            alternative hypothesis: true difference in means is not equal to 0 
            95 percent confidence interval:
             0.5409887 1.1186414 
            sample estimates:
             mean of x  mean of y 
            0.85294237 0.02312732 
         #+END_EXAMPLE
** Wilcoxon
   - Wilcoxon Test
     - non-parametric comparison of distributions
     - It is about rank based agreement
       - if we look at the distribution by rank how similar is it?
     - Pairwise comparison
     - Good for non-normal distributions
     - A little more strict than t-test
      
*** Wilcoxon in R
          #+BEGIN_EXAMPLE
          > wilcox.test(rnorm(100),rnorm(100))
          
          	Wilcoxon rank sum test with continuity correction
          
          data:  rnorm(100) and rnorm(100) 
          W = 5490, p-value = 0.2317
          alternative hypothesis: true location shift is not equal to 0 
          
          > wilcox.test(runif(100),rnorm(100))
          
          	Wilcoxon rank sum test with continuity correction
          
          data:  runif(100) and rnorm(100) 
          W = 6348, p-value = 0.0009931
          alternative hypothesis: true location shift is not equal to 0 
          
          > wilcox.test(rnorm(100,1),rnorm(100))
          
          	Wilcoxon rank sum test with continuity correction
          
          data:  rnorm(100, 1) and rnorm(100) 
          W = 7418, p-value = 3.486e-09
          alternative hypothesis: true location shift is not equal to 0 
          #+END_EXAMPLE
** Kolmogorov-Smirnov Tests
   - Non parametric
   - good with SE data and data with skew
   - compares the maximum distance between CDFs
   - Usually used on continuous data but works on ECDFs.
   - Very strict
   - P-values > 0.05 mean they are similar distributions or not
     different
*** R
    #+BEGIN_SRC R
    ks.test(rnorm(100),rnorm(100))
    ks.test(runif(100),rnorm(100))
    ks.test(rnorm(100,1),rnorm(100))
    #+END_SRC R
**** R Output
         #+BEGIN_EXAMPLE
         > ks.test(rnorm(100),rnorm(100))
         
         	Two-sample Kolmogorov-Smirnov test
         
         data:  rnorm(100) and rnorm(100) 
         D = 0.17, p-value = 0.1111
         alternative hypothesis: two-sided 
         
         > ks.test(runif(100),rnorm(100))
         
         	Two-sample Kolmogorov-Smirnov test
         
         data:  runif(100) and rnorm(100) 
         D = 0.52, p-value = 3.612e-12
         alternative hypothesis: two-sided 
         
         > ks.test(rnorm(100,1),rnorm(100))
         
         	Two-sample Kolmogorov-Smirnov test
         
         data:  rnorm(100, 1) and rnorm(100) 
         D = 0.46, p-value = 1.292e-09
         alternative hypothesis: two-sided 
         #+END_EXAMPLE
** X^2 Test
   - Good for non-parametric distributions
   - Good for counts
   - You need to bin your data first
   - it's input is a distribution
   - watch it, the input is a distribution
   - Not reliable on continuous values because you need to bin values
