stats-test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-07 Thu 14:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Abram Hindle" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline11">1. Statistical Tests</a>
<ul>
<li><a href="#orgheadline1">1.1. P-Values</a></li>
<li><a href="#orgheadline3">1.2. T-Test</a>
<ul>
<li><a href="#orgheadline2">1.2.1. T-Test in R</a></li>
</ul>
</li>
<li><a href="#orgheadline5">1.3. Wilcoxon</a>
<ul>
<li><a href="#orgheadline4">1.3.1. Wilcoxon in R</a></li>
</ul>
</li>
<li><a href="#orgheadline8">1.4. Kolmogorov-Smirnov Tests</a>
<ul>
<li><a href="#orgheadline7">1.4.1. R</a></li>
</ul>
</li>
<li><a href="#orgheadline10">1.5. X<sup>2</sup> Test</a>
<ul>
<li><a href="#orgheadline9">1.5.1. R</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline27">2. Bootstrapping and Confidence Intervals</a>
<ul>
<li><a href="#orgheadline14">2.1. Confidence intervals</a>
<ul>
<li><a href="#orgheadline12">2.1.1. Are 2 distributions similar?</a></li>
<li><a href="#orgheadline13">2.1.2. How do we calculate?</a></li>
</ul>
</li>
<li><a href="#orgheadline15">2.2. Bootstrapping</a></li>
<li><a href="#orgheadline18">2.3. Bootstrapping a mean example</a>
<ul>
<li><a href="#orgheadline16">2.3.1. R code</a></li>
<li><a href="#orgheadline17">2.3.2. R Run</a></li>
</ul>
</li>
<li><a href="#orgheadline23">2.4. Difference of means</a>
<ul>
<li><a href="#orgheadline19">2.4.1. R code</a></li>
<li><a href="#orgheadline20">2.4.2. R Run</a></li>
<li><a href="#orgheadline21">2.4.3. Plot it</a></li>
<li><a href="#orgheadline22">2.4.4. Results</a></li>
</ul>
</li>
<li><a href="#orgheadline26">2.5. Difference of X?</a>
<ul>
<li><a href="#orgheadline24">2.5.1. R code for difference of skews</a></li>
<li><a href="#orgheadline25">2.5.2. Results</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">1</span> Statistical Tests</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> P-Values</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Can we accept or reject the null hypothesis?
<ul class="org-ul">
<li>usually choose a threshold</li>
<li>0.05 is popular</li>
<li>0.01 is safer</li>
<li>People get uncomfortable when you get values anywhere near
there.</li>
<li>P-values are not really comparable. Maybe in magnitude.</li>
<li>Large datasets generally cause pretty clear p-values.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.2</span> T-Test</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Student's T Test
<ul class="org-ul">
<li>Originally used to for ensuring the quality of beer
<ul class="org-ul">
<li>Not just any beer: Guiness</li>
</ul></li>
<li>process comparison</li>
<li>Compare distributions</li>
<li>Student is William Sealy Gosset, Student is a pen name.</li>
<li>Why do we care?
<ul class="org-ul">
<li>Compare if two generally normally distributions 
have equal means?</li>
<li>What if we got lucky and found the means to be the same? 
<ul class="org-ul">
<li>What is the chance of that?</li>
</ul></li>
<li>Can we trust it?</li>
</ul></li>
<li>When not to use it:
<ul class="org-ul">
<li>when the data is not normal.</li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.2.1</span> T-Test in R</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><p>
in R:
</p>
<div class="org-src-container">

<pre class="src src-R">t.test(rnorm(100),rnorm(100))
t.test(runif(100),rnorm(100))
t.test(rnorm(100,1),rnorm(100))
</pre>
</div>
<pre class="example">
&gt; t.test(rnorm(100),rnorm(100))

    Welch Two Sample t-test

data:  rnorm(100) and rnorm(100) 
t = 0.3034, df = 193.367, p-value = 0.7619
alternative hypothesis: true difference in means is not equal to 0 
95 percent confidence interval:
 -0.2330280  0.3177391 
sample estimates:
 mean of x  mean of y 
0.07018111 0.02782554 

&gt; t.test(runif(100),rnorm(100))

    Welch Two Sample t-test

data:  runif(100) and rnorm(100) 
t = 2.7514, df = 115.295, p-value = 0.006893
alternative hypothesis: true difference in means is not equal to 0 
95 percent confidence interval:
 0.08531389 0.52385119 
sample estimates:
mean of x mean of y 
0.4778445 0.1732620 

&gt; t.test(rnorm(100,1),rnorm(100))

    Welch Two Sample t-test

data:  rnorm(100, 1) and rnorm(100) 
t = 6.1553, df = 197.077, p-value = 4.116e-09
alternative hypothesis: true difference in means is not equal to 0 
95 percent confidence interval:
 0.5696437 1.1067288 
sample estimates:
mean of x mean of y 
0.9432221 0.1050358 

&gt; t.test(rnorm(100,1),rnorm(100))

    Welch Two Sample t-test

data:  rnorm(100, 1) and rnorm(100) 
t = 5.6662, df = 195.334, p-value = 5.176e-08
alternative hypothesis: true difference in means is not equal to 0 
95 percent confidence interval:
 0.5409887 1.1186414 
sample estimates:
 mean of x  mean of y 
0.85294237 0.02312732
</pre></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.3</span> Wilcoxon</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Wilcoxon Test
<ul class="org-ul">
<li>non-parametric comparison of distributions</li>
<li>It is about rank based agreement
<ul class="org-ul">
<li>if we look at the distribution by rank how similar is it?</li>
</ul></li>
<li>Pairwise comparison</li>
<li>Good for non-normal distributions</li>
<li>A little more strict than t-test</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.3.1</span> Wilcoxon in R</h4>
<div class="outline-text-4" id="text-1-3-1">
<pre class="example">
&gt; wilcox.test(rnorm(100),rnorm(100))

      Wilcoxon rank sum test with continuity correction

data:  rnorm(100) and rnorm(100) 
W = 5490, p-value = 0.2317
alternative hypothesis: true location shift is not equal to 0 

&gt; wilcox.test(runif(100),rnorm(100))

      Wilcoxon rank sum test with continuity correction

data:  runif(100) and rnorm(100) 
W = 6348, p-value = 0.0009931
alternative hypothesis: true location shift is not equal to 0 

&gt; wilcox.test(rnorm(100,1),rnorm(100))

      Wilcoxon rank sum test with continuity correction

data:  rnorm(100, 1) and rnorm(100) 
W = 7418, p-value = 3.486e-09
alternative hypothesis: true location shift is not equal to 0
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.4</span> Kolmogorov-Smirnov Tests</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Non parametric</li>
<li>good with SE data and data with skew</li>
<li>compares the maximum distance between CDFs</li>
<li>Usually used on continuous data but works on ECDFs.</li>
<li>Very strict</li>
<li>P-values &gt; 0.05 mean they are similar distributions or not
different</li>
</ul>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">1.4.1</span> R</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
#+BEGIN<sub>SRC</sub> R
ks.test(rnorm(100),rnorm(100))
ks.test(runif(100),rnorm(100))
ks.test(rnorm(100,1),rnorm(100))
#+END<sub>SRC</sub> R
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline6"></a>R Output<br  /><div class="outline-text-5" id="text-1-4-1-1">
<pre class="example">
&gt; ks.test(rnorm(100),rnorm(100))

       Two-sample Kolmogorov-Smirnov test

data:  rnorm(100) and rnorm(100) 
D = 0.17, p-value = 0.1111
alternative hypothesis: two-sided 

&gt; ks.test(runif(100),rnorm(100))

       Two-sample Kolmogorov-Smirnov test

data:  runif(100) and rnorm(100) 
D = 0.52, p-value = 3.612e-12
alternative hypothesis: two-sided 

&gt; ks.test(rnorm(100,1),rnorm(100))

       Two-sample Kolmogorov-Smirnov test

data:  rnorm(100, 1) and rnorm(100) 
D = 0.46, p-value = 1.292e-09
alternative hypothesis: two-sided
</pre>
</div></li></ol>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.5</span> X<sup>2</sup> Test</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Good for non-parametric distributions</li>
<li>Good for counts</li>
<li>You need to bin your data first</li>
<li>it's input is a distribution</li>
<li>watch it, the input is a distribution</li>
<li>Not reliable on continuous values because you need to bin values</li>
</ul>
</div>
