stats-test.org
*** R
    #+BEGIN_EXAMPLE
    > chisq.test(c(10,10,10,30),p=c(20,20,20,30),rescale.p=TRUE)
    
    	Chi-squared test for given probabilities
    
    data:  c(10, 10, 10, 30)
    X-squared = 7.5, df = 3, p-value = 0.05756
    
    > chisq.test(c(10,10,10,30),p=c(4,5,6,7),rescale.p=TRUE)
    
    	Chi-squared test for given probabilities
    
    data:  c(10, 10, 10, 30)
    X-squared = 9.754, df = 3, p-value = 0.02078
    
    > chisq.test(c(10,10,10,30),p=c(11,11,11,31),rescale.p=TRUE)
    
    	Chi-squared test for given probabilities
    
    data:  c(10, 10, 10, 30)
    X-squared = 0.058651, df = 3, p-value = 0.9963
    
    > chisq.test(c(10,10,10,30),p=c(0,11,11,0),rescale.p=TRUE) # zeros are bad
    
    	Chi-squared test for given probabilities
    
    data:  c(10, 10, 10, 30)
    X-squared = Inf, df = 3, p-value < 2.2e-16
    
    Warning message:
    In chisq.test(c(10, 10, 10, 30), p = c(0, 11, 11, 0), rescale.p = TRUE) :
      Chi-squared approximation may be incorrect
    > 
    > south <- c(10,20,30,40)
    > north <- c(5,30,30,40)
    > nstab <- as.table(rbind(south,north))
    > chisq.test(nstab)
    
    	Pearson's Chi-squared test
    
    data:  nstab
    X-squared = 3.5468, df = 3, p-value = 0.3147
    
    > south <- c(10,20,30,40)
    > north <- c(90,30,30,40)
    > nstab <- as.table(rbind(south,north))
    > chisq.test(nstab)
    
    	Pearson's Chi-squared test
    
    data:  nstab
    X-squared = 42.126, df = 3, p-value = 3.772e-09
        > 
    > stbdtypes <- c("Source","Test","Build","Doc")
    > maint     <- c("Adaptive","Perfective","Corrective")
    > stbds <- stbdtypes[runif(100)*4 + 1]
    > maints <- maint[runif(100)*3 + 1]
    > head(stbds)
    [1] "Build"  "Build"  "Test"   "Source" "Test"   "Doc"   
    > head(maints)
    [1] "Adaptive"   "Corrective" "Perfective" "Adaptive"   "Adaptive"  
    [6] "Corrective"
    > st <- table(stbds,maints)
    > st
            maints
    stbds    Adaptive Corrective Perfective
      Build        11          8          3
      Doc           5         11         13
      Source        7         11          9
      Test          9          5          8
    > chisq.test(st)
    
    	Pearson's Chi-squared test
    
    data:  st
    X-squared = 10.148, df = 6, p-value = 0.1186
    
    > st2 <- t(cbind(st[,"Adaptive"],st[,"Corrective"]))
    > st2
         Build Doc Source Test
    [1,]    11   5      7    9
    [2,]     8  11     11    5
    > chisq.test(st2)
    
    	Pearson's Chi-squared test
    
    data:  st2
    X-squared = 4.6304, df = 3, p-value = 0.201
    
    > # example where we make a table with junk results
    > st3 <- t(cbind(st[,"Adaptive"],max(5,round(st[,"Corrective"]+10*rnorm(4)))))
    > st3
         Build Doc Source Test
    [1,]    11   5      7    9
    [2,]    11  11     11   11
    > chisq.test(st3)
    
    	Pearson's Chi-squared test
    
    data:  st3
    X-squared = 1.4811, df = 3, p-value = 0.6866
    #+END_EXAMPLE

* Bootstrapping and Confidence Intervals
** Confidence intervals
   - Confidence intervals tell us where we expect values to be.
   - For instance the 95% confidence interval of the mean of our
     sample is [0.5,1.5]. 
   - That would mean that in 95% of the cases derived from the
     population that we expect the mean to between 0.5 and 1.5.
   - The 99% confidence interval might be wider: [0.3,1.7]
     - That means 99% of the mean estimates will be in that range.
     - Higher confidence
     - Wider range of the statistic.
   - It gives us some idea of a range of values from the statistic.
   - Given a range of statistics if we order them and clip off the bottom alpha/2 and top alpha/2 values we 
     get the remaining confidence interval.
     - 95% has an alpha of 5% so clip the top 2.5% and bottom 2.5% off and look at min and max, that's
       our confidence interval.
*** Are 2 distributions similar?
    - Often we can use confidence intervals of the difference of means
      to determine if something is statistically significantly
      different or similar.
    - Instead of just generating a p-value we can under the range.
    - if the 95% confidence interval of mean(x) - mean(y) does not
      cross 0 it suggests that the distributions are significantly different.
      - e.g. 95% CI of [-0.5,-0.1] implies that 95% of the time
        difference of means between x and y is -0.5 to -0.1.
        - statistically significant difference!
      - e.g. 95% CI of [0.1,0.5] implies that 95% of the time
        difference of means between x and y is 0.1 to 0.5
        - statistically significant difference!
      - e.g. 95% CI of [-0.5,0.5] implies that 95% of the time
        difference of means between x and y is -0.5 to 0.5
        - not a statistically significant difference!
        - the interval overlaps 0
*** How do we calculate?
    - Informal -- we just estimate
    - Direct calculation -- for parametric statistics there are parametric methods of calculating a CI
    - Bootstrapping! Use a computer and sampling to abuse stats and
      produce a distribution of statistics!
      - we deal with non-parametric data so we like this one
** Bootstrapping
  - https://en.wikipedia.org/wiki/Bootstrapping_(statistics)
  - Bootstrapping is sampling a lot.
    - massive amounts of random sampling without replacement of a sample
  - What if the best information we have is the current sample?
  - Boostrapping lets talk about statistics about statistics
  - We can build confidence intervals with bootstrapping.
** Bootstrapping a mean example
  - we sampled 100 elements
    - we calculate 1 mean
    - is this good enough?
    - what if 1 big value is messing everything up?
    - why don't we sample 100 elements 100 times from the 100 elements.
      - some of the outliers won't appear in all of the samples
      - we now can calculate the mean of each of the samples
      - we can now see the distribution of means
        - its location
        - its shape
      - fundamentally we are more confident about the expected mean
      - We have a distribution now.
        - so what?
        - take the mean again? Sure whatever.
        - Why not the confidence interval?
        - R quantile will sort and clip for us
        - just return the min and max of the middle X % of the distribution
*** R code
    #+BEGIN_SRC R
    N=100
    alpha = 0.05
    data = rnorm(N)
    mean(data)
    mean(sample(data,N,replace=TRUE))
    booted <- sapply(c(1:N), function(i) { mean(sample(data,N,replace=TRUE)) })
    mean(booted)
    summary(booted)
    quantile(booted,c(alpha/2,1.0 - alpha/2))
    #+END_SRC R

    #+RESULTS:
    | -0.0943985543925813 |
    |   0.247765366599378 |

