stats-test.html
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.5.1</span> R</h4>
<div class="outline-text-4" id="text-1-5-1">
<pre class="example">
&gt; chisq.test(c(10,10,10,30),p=c(20,20,20,30),rescale.p=TRUE)

    Chi-squared test for given probabilities

data:  c(10, 10, 10, 30)
X-squared = 7.5, df = 3, p-value = 0.05756

&gt; chisq.test(c(10,10,10,30),p=c(4,5,6,7),rescale.p=TRUE)

    Chi-squared test for given probabilities

data:  c(10, 10, 10, 30)
X-squared = 9.754, df = 3, p-value = 0.02078

&gt; chisq.test(c(10,10,10,30),p=c(11,11,11,31),rescale.p=TRUE)

    Chi-squared test for given probabilities

data:  c(10, 10, 10, 30)
X-squared = 0.058651, df = 3, p-value = 0.9963

&gt; chisq.test(c(10,10,10,30),p=c(0,11,11,0),rescale.p=TRUE) # zeros are bad

    Chi-squared test for given probabilities

data:  c(10, 10, 10, 30)
X-squared = Inf, df = 3, p-value &lt; 2.2e-16

Warning message:
In chisq.test(c(10, 10, 10, 30), p = c(0, 11, 11, 0), rescale.p = TRUE) :
  Chi-squared approximation may be incorrect
&gt; 
&gt; south &lt;- c(10,20,30,40)
&gt; north &lt;- c(5,30,30,40)
&gt; nstab &lt;- as.table(rbind(south,north))
&gt; chisq.test(nstab)

    Pearson's Chi-squared test

data:  nstab
X-squared = 3.5468, df = 3, p-value = 0.3147

&gt; south &lt;- c(10,20,30,40)
&gt; north &lt;- c(90,30,30,40)
&gt; nstab &lt;- as.table(rbind(south,north))
&gt; chisq.test(nstab)

    Pearson's Chi-squared test

data:  nstab
X-squared = 42.126, df = 3, p-value = 3.772e-09
    &gt; 
&gt; stbdtypes &lt;- c("Source","Test","Build","Doc")
&gt; maint     &lt;- c("Adaptive","Perfective","Corrective")
&gt; stbds &lt;- stbdtypes[runif(100)*4 + 1]
&gt; maints &lt;- maint[runif(100)*3 + 1]
&gt; head(stbds)
[1] "Build"  "Build"  "Test"   "Source" "Test"   "Doc"   
&gt; head(maints)
[1] "Adaptive"   "Corrective" "Perfective" "Adaptive"   "Adaptive"  
[6] "Corrective"
&gt; st &lt;- table(stbds,maints)
&gt; st
        maints
stbds    Adaptive Corrective Perfective
  Build        11          8          3
  Doc           5         11         13
  Source        7         11          9
  Test          9          5          8
&gt; chisq.test(st)

    Pearson's Chi-squared test

data:  st
X-squared = 10.148, df = 6, p-value = 0.1186

&gt; st2 &lt;- t(cbind(st[,"Adaptive"],st[,"Corrective"]))
&gt; st2
     Build Doc Source Test
[1,]    11   5      7    9
[2,]     8  11     11    5
&gt; chisq.test(st2)

    Pearson's Chi-squared test

data:  st2
X-squared = 4.6304, df = 3, p-value = 0.201

&gt; # example where we make a table with junk results
&gt; st3 &lt;- t(cbind(st[,"Adaptive"],max(5,round(st[,"Corrective"]+10*rnorm(4)))))
&gt; st3
     Build Doc Source Test
[1,]    11   5      7    9
[2,]    11  11     11   11
&gt; chisq.test(st3)

    Pearson's Chi-squared test

data:  st3
X-squared = 1.4811, df = 3, p-value = 0.6866
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">2</span> Bootstrapping and Confidence Intervals</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">2.1</span> Confidence intervals</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Confidence intervals tell us where we expect values to be.</li>
<li>For instance the 95% confidence interval of the mean of our
sample is [0.5,1.5].</li>
<li>That would mean that in 95% of the cases derived from the
population that we expect the mean to between 0.5 and 1.5.</li>
<li>The 99% confidence interval might be wider: [0.3,1.7]
<ul class="org-ul">
<li>That means 99% of the mean estimates will be in that range.</li>
<li>Higher confidence</li>
<li>Wider range of the statistic.</li>
</ul></li>
<li>It gives us some idea of a range of values from the statistic.</li>
<li>Given a range of statistics if we order them and clip off the bottom alpha/2 and top alpha/2 values we 
get the remaining confidence interval.
<ul class="org-ul">
<li>95% has an alpha of 5% so clip the top 2.5% and bottom 2.5% off and look at min and max, that's
our confidence interval.</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">2.1.1</span> Are 2 distributions similar?</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Often we can use confidence intervals of the difference of means
to determine if something is statistically significantly
different or similar.</li>
<li>Instead of just generating a p-value we can under the range.</li>
<li>if the 95% confidence interval of mean(x) - mean(y) does not
cross 0 it suggests that the distributions are significantly different.
<ul class="org-ul">
<li>e.g. 95% CI of [-0.5,-0.1] implies that 95% of the time
difference of means between x and y is -0.5 to -0.1.
<ul class="org-ul">
<li>statistically significant difference!</li>
</ul></li>
<li>e.g. 95% CI of [0.1,0.5] implies that 95% of the time
difference of means between x and y is 0.1 to 0.5
<ul class="org-ul">
<li>statistically significant difference!</li>
</ul></li>
<li>e.g. 95% CI of [-0.5,0.5] implies that 95% of the time
difference of means between x and y is -0.5 to 0.5
<ul class="org-ul">
<li>not a statistically significant difference!</li>
<li>the interval overlaps 0</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">2.1.2</span> How do we calculate?</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Informal &#x2013; we just estimate</li>
<li>Direct calculation &#x2013; for parametric statistics there are parametric methods of calculating a CI</li>
<li>Bootstrapping! Use a computer and sampling to abuse stats and
produce a distribution of statistics!
<ul class="org-ul">
<li>we deal with non-parametric data so we like this one</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">2.2</span> Bootstrapping</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Bootstrapping_(statistics)">https://en.wikipedia.org/wiki/Bootstrapping_(statistics)</a></li>
<li>Bootstrapping is sampling a lot.
<ul class="org-ul">
<li>massive amounts of random sampling without replacement of a sample</li>
</ul></li>
<li>What if the best information we have is the current sample?</li>
<li>Boostrapping lets talk about statistics about statistics</li>
<li>We can build confidence intervals with bootstrapping.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">2.3</span> Bootstrapping a mean example</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>we sampled 100 elements
<ul class="org-ul">
<li>we calculate 1 mean</li>
<li>is this good enough?</li>
<li>what if 1 big value is messing everything up?</li>
<li>why don't we sample 100 elements 100 times from the 100 elements.
<ul class="org-ul">
<li>some of the outliers won't appear in all of the samples</li>
<li>we now can calculate the mean of each of the samples</li>
<li>we can now see the distribution of means
<ul class="org-ul">
<li>its location</li>
<li>its shape</li>
</ul></li>
<li>fundamentally we are more confident about the expected mean</li>
<li>We have a distribution now.
<ul class="org-ul">
<li>so what?</li>
<li>take the mean again? Sure whatever.</li>
<li>Why not the confidence interval?</li>
<li>R quantile will sort and clip for us</li>
<li>just return the min and max of the middle X % of the distribution</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">2.3.1</span> R code</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
#+BEGIN<sub>SRC</sub> R
N=100
alpha = 0.05
data = rnorm(N)
mean(data)
mean(sample(data,N,replace=TRUE))
booted &lt;- sapply(c(1:N), function(i) { mean(sample(data,N,replace=TRUE)) })
mean(booted)
summary(booted)
quantile(booted,c(alpha/2,1.0 - alpha/2))
#+END<sub>SRC</sub> R
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">-0.0943985543925813</td>
</tr>

<tr>
<td class="org-right">0.247765366599378</td>
</tr>
</tbody>
</table>
</div>
</div>
