stats-test.html

<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">2.3.2</span> R Run</h4>
<div class="outline-text-4" id="text-2-3-2">
<pre class="example">
&gt;     N=100
&gt;     alpha = 0.05
&gt;     data = rnorm(N)
&gt;     mean(data)
[1] 0.1086147
&gt;     mean(sample(data,N,replace=TRUE))
[1] -0.0537734
&gt;     booted &lt;- sapply(c(1:N), function(i) { mean(sample(data,N,replace=TRUE)) })
&gt;     mean(booted)
[1] 0.09648877
&gt;     summary(booted)
    Min.  1st Qu.   Median     Mean  3rd Qu.     Max. 
-0.08934  0.02356  0.08938  0.09649  0.16576  0.35589 
&gt;     quantile(booted,c(alpha/2,1.0 - alpha/2))
      2.5%      97.5% 
-0.0690190  0.2792187 
&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">2.4</span> Difference of means</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>we sampled 100 elements from each distribution (2)
<ul class="org-ul">
<li>we calculate  mean(d1) - means(d2)</li>
<li>is this good enough?</li>
<li>what if 1 big value is messing everything up?</li>
<li>why don't we sample 100 elements 100 times from the each distribution of 100 elements.
<ul class="org-ul">
<li>we now can calculate the mean difference between each of these samples</li>
<li>we can now see the distribution of difference means
<ul class="org-ul">
<li>its location</li>
<li>its shape</li>
</ul></li>
<li>fundamentally we are more confident about the expected mean</li>
<li>We have a distribution now.
<ul class="org-ul">
<li>so what?</li>
<li>take the mean again? Sure whatever.</li>
<li>Why not the confidence interval?</li>
<li>R quantile will sort and clip for us</li>
<li>just return the min and max of the middle X % of the distribution</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">2.4.1</span> R code</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">

<pre class="src src-R">N=100
alpha = 0.05
data1 = rnorm(N)
data2 = rnorm(N,mean=0.5)
mean(data1)
mean(data2)
mean(data1) -  mean(data2)    
booted <span style="color: #008b8b;">&lt;-</span> sapply(c(1:N), <span style="color: #a020f0;">function</span>(i) { 
      mean( sample(data1,N,replace=<span style="color: #228b22;">TRUE</span>) ) - 
      mean( sample(data2,N,replace=<span style="color: #228b22;">TRUE</span>)  ) })
mean(booted)
summary(booted)
quantile(booted,c(alpha/2,1.0 - alpha/2))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">2.4.2</span> R Run</h4>
<div class="outline-text-4" id="text-2-4-2">
<pre class="example">
&gt;     N=100
&gt;     alpha = 0.05
&gt;     data1 = rnorm(N)
&gt;     data2 = rnorm(N,mean=0.5)
&gt;     mean(data1)
[1] 0.01280888
&gt;     mean(data2)
[1] 0.5015766
&gt;     mean(data1) -  mean(data2)    
[1] -0.4887677
&gt;     booted &lt;- sapply(c(1:N), function(i) { 
+           mean( sample(data1,N,replace=TRUE) ) - 
+           mean( sample(data2,N,replace=TRUE)  ) })
&gt;     mean(booted)
[1] -0.475228
&gt;     summary(booted)
    Min.  1st Qu.   Median     Mean  3rd Qu.     Max. 
-0.93557 -0.58166 -0.48149 -0.47523 -0.35196 -0.04391 
&gt;     quantile(booted,c(alpha/2,1.0 - alpha/2))
      2.5%      97.5% 
-0.7658303 -0.1847355 
&gt;
</pre>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">2.4.3</span> Plot it</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">

<pre class="src src-R">counts <span style="color: #008b8b;">&lt;-</span> c(100,100,100,500,500,500,1000,1000,10000)
boots <span style="color: #008b8b;">&lt;-</span> sapply(counts, <span style="color: #a020f0;">function</span>(N) {
    alpha = 0.05
    data1 = rnorm(N)
    data2 = rnorm(N,mean=0.5)
    mean(data1)
    mean(data2)
    mean(data1) -  mean(data2)    
    booted <span style="color: #008b8b;">&lt;-</span> sapply(c(1:N), <span style="color: #a020f0;">function</span>(i) { mean( sample(data1,N,replace=<span style="color: #228b22;">TRUE</span>) ) - mean( sample(data2,N,replace=<span style="color: #228b22;">TRUE</span>)  ) })
    print(mean(booted))
    print(summary(booted))
    print(N)
    print(quantile(booted,c(alpha/2,1.0 - alpha/2)))
    booted
})
plot(density(boots[[length(boots)]]),xlim=c(-1,0.25),ylim=c(0,30))
<span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">in</span> c(1:length(boots))) {
    lines(density(boots[[i]]),col=i)
}
legend(0,30,counts,pch=1,col=c(1:length(boots)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">2.4.4</span> Results</h4>
<div class="outline-text-4" id="text-2-4-4">
<pre class="example">
&gt;     counts &lt;- c(100,100,100,500,500,500,1000,1000,10000)
&gt;     boots &lt;- sapply(counts, function(N) {
+         alpha = 0.05
+         data1 = rnorm(N)
+         data2 = rnorm(N,mean=0.5)
+         mean(data1)
+         mean(data2)
+         mean(data1) -  mean(data2)    
+         booted &lt;- sapply(c(1:N), function(i) { mean( sample(data1,N,replace=TRUE) ) - mean( sample(data2,N,replace=TRUE)  ) })
+         print(mean(booted))
+         print(summary(booted))
+         print(N)
+         print(quantile(booted,c(alpha/2,1.0 - alpha/2)))
+         booted
+     })
[1] -0.4917793
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-0.9578 -0.5718 -0.4916 -0.4918 -0.3826 -0.2077 
[1] 100
      2.5%      97.5% 
-0.8034647 -0.2512316 
[1] -0.4610482
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-0.7874 -0.5340 -0.4560 -0.4610 -0.3779 -0.1083 
[1] 100
      2.5%      97.5% 
-0.7157980 -0.2230874 
[1] -0.7882121
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-1.2104 -0.8786 -0.7984 -0.7882 -0.6770 -0.3673 
[1] 100
      2.5%      97.5% 
-1.0942129 -0.4880081 
[1] -0.5126469
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-0.6824 -0.5531 -0.5115 -0.5126 -0.4705 -0.3081 
[1] 500
      2.5%      97.5% 
-0.6373032 -0.3899576 
[1] -0.4067484
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-0.5898 -0.4521 -0.4028 -0.4067 -0.3628 -0.1931 
[1] 500
      2.5%      97.5% 
-0.5408313 -0.2826443 
[1] -0.4975045
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-0.6779 -0.5429 -0.4981 -0.4975 -0.4518 -0.3217 
[1] 500
      2.5%      97.5% 
-0.6297027 -0.3722989 
[1] -0.5537908
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-0.7010 -0.5827 -0.5536 -0.5538 -0.5249 -0.4185 
[1] 1000
      2.5%      97.5% 
-0.6400824 -0.4657624 
[1] -0.4787345
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-0.6403 -0.5102 -0.4800 -0.4787 -0.4471 -0.3218 
[1] 1000
      2.5%      97.5% 
-0.5663714 -0.3973088 
[1] -0.4844369
   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
-0.5446 -0.4942 -0.4845 -0.4844 -0.4746 -0.4322 
[1] 10000
      2.5%      97.5% 
-0.5119642 -0.4562765 
&gt;     plot(density(boots[[length(boots)]]),xlim=c(-1,0.25),ylim=c(0,30))
&gt;     for (i in c(1:length(boots))) {
+         lines(density(boots[[i]]),col=i)
+     }
&gt;     legend(0,30,counts,pch=1,col=c(1:length(boots)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">2.5</span> Difference of X?</h3>
<div class="outline-text-3" id="text-2-5">
<p>
We don't have to use averages.
We can use medians or whatever other statistic you like
</p>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">2.5.1</span> R code for difference of skews</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">

<pre class="src src-R"><span style="color: #b22222;"># </span><span style="color: #b22222;">difference of skews</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">install.packages("moments")</span>
<span style="color: #008b8b;">library</span>(moments)
N=100
alpha = 0.05
data1 = rnorm(N)
data2 = rnorm(N,mean=0.5)
skewness(data1)
skewness(data2)
skewness(data1) -  skewness(data2)    
booted <span style="color: #008b8b;">&lt;-</span> sapply(c(1:N), <span style="color: #a020f0;">function</span>(i) { skewness( sample(data1,N,replace=<span style="color: #228b22;">TRUE</span>) ) - skewness( sample(data2,N,replace=<span style="color: #228b22;">TRUE</span>)  ) })
mean(booted)
summary(booted)
quantile(booted,c(alpha/2,1.0 - alpha/2))
</pre>
</div>
</div>
</div>
